app/views/posts/_index.html.erb

        <td class="post-tags">
          <%tags = post.tags.map {|t| t.name} %>
---
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "post_tags"."tag_id" = "tags"."id" INNER JOIN "posts" ON "posts"."id" = "post_tags"."post_id" GROUP BY post_tags.tag_id  ORDER BY COUNT(*) DESC