app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY updated_at DESC
SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags"
---
  def index
    @tags = sorted_tags
    @posts = Post.all.order('updated_at DESC')
    @posts.each(&:tags)

SELECT "posts".* FROM "posts" INNER JOIN "post_tags" ON "posts"."id" = "post_tags"."post_id" WHERE "post_tags"."tag_id" = ?  ORDER BY updated_at DESC  [["tag_id", 2]]
SELECT "tags".* FROM "tags"  WHERE "tags"."name" = 'testy'
---
  def filter
    @tags = sorted_tags
    p params[:tag]
    decoded_tag = URI.decode(params[:tag])
    p decoded_tag
    @posts = Tag.where(name: decoded_tag)[0].posts.order('updated_at DESC')
    p @posts
    @posts.each(&:tags)

INSERT INTO "post_tags" ("created_at", "post_id", "tag_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-01-30 11:12:31.054148"], ["post_id", 12], ["tag_id", 3], ["updated_at", "2016-01-30 11:12:31.054148"]]
INSERT INTO "posts" ("author", "body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "igor"], ["body", "je mi zle"], ["created_at", "2016-01-29 18:28:56.706815"], ["title", ""], ["updated_at", "2016-01-29 18:28:56.706815"]]
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-01-30 11:12:31.042304"], ["name", "A"], ["updated_at", "2016-01-30 11:12:31.042304"]]
SELECT  1 AS one FROM "tags"  WHERE ("tags"."name" = 'neviem' AND "tags"."id" != 2) LIMIT 1
---
  def create
    @post = Post.new(post_params)
    @tag = Tag.new(tag_params)
    respond_to do |format|
      if !@tag[:name].empty? && @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "tags"  WHERE "tags"."name" = 'neviem' LIMIT 1
SELECT "tags".* FROM "tags"  WHERE "tags"."name" = 'neviem'
UPDATE "posts" SET "author" = ?, "body" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 4  [["author", "jano "], ["body", "je nanic"], ["title", "uloha"], ["updated_at", "2016-01-31 12:21:44.810082"]]
INSERT INTO "post_tags" ("created_at", "post_id", "tag_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-01-30 19:02:14.460035"], ["post_id", 3], ["tag_id", 2], ["updated_at", "2016-01-30 19:02:14.460035"]]
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-01-30 20:34:32.622712"], ["name", "sa"], ["updated_at", "2016-01-30 20:34:32.622712"]]
---
  def update
    @post = Post.find(params[:id])
    @tag = Tag.new(tag_params)
    respond_to do |format|
      if !@tag[:name].empty? && @post.update_attributes(post_params)
        @post.add_tags(@tag[:name])
        format.html { redirect_to @post, notice: 'Post was successfully updated.' }
      else
        format.html { render action: 'edit' }
        format.json { render json: @post.errors, status: :unprocessable_entity }
      end
      if @tag[:name].empty?
        @tag.save

DELETE FROM "post_tags" WHERE "post_tags"."post_id" = ? AND "post_tags"."tag_id" IN (17, 18, 19, 13)  [["post_id", 12]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 17]]
SELECT "post_tags".* FROM "post_tags"  WHERE "post_tags"."post_id" = ? AND "post_tags"."tag_id" IN (2, 24, 25)  [["post_id", 19]]
SELECT "tags".* FROM "tags"
SELECT  1 AS one FROM "posts" INNER JOIN "post_tags" ON "posts"."id" = "post_tags"."post_id" WHERE "post_tags"."tag_id" = ? LIMIT 1  [["tag_id", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "post_tags" ON "posts"."id" = "post_tags"."post_id" WHERE "post_tags"."tag_id" = ?  [["tag_id", 17]]
---
  def destroy
    @post.tags.destroy_all
    @post.destroy
    Tag.all.each do |tag|
      tag.posts.empty? && tag.destroy